RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_exmc.c
/* EXMC_NINTEN register interrupt enable bit and interrupt status bit interval */
#define NINTEN_INTEN_INTS_INTERVAL        ((uint32_t)0x00000003U)  /* bit offset of INTEN_INTS */

/*!
    \brief      deinitialize EXMC NOR/SRAM region (API_ID(0x0001U))
    \param[in]  exmc_norsram_region: select the region of bank0
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK0_NORSRAM_REGIONx(x=0..3): EXMC BANK0 REGIONx
    \param[out] none
    \retval     none
*/
void exmc_norsram_deinit(uint32_t exmc_norsram_region)
{
    /* reset the registers */
    EXMC_SNCTL(exmc_norsram_region) = BANK0_SNCTL_RESET;
    EXMC_SNTCFG(exmc_norsram_region) = BANK0_SNTCFG_RESET;
    EXMC_SNWTCFG(exmc_norsram_region) = BANK0_SNWTCFG_RESET;
}

/*!
    \brief      initialize exmc_norsram_parameter_struct with the default values (API_ID(0x0002U))
    \param[in]  none
    \param[out] exmc_norsram_init_struct: the initialized struct exmc_norsram_parameter_struct pointer
    \retval     none
*/
void exmc_norsram_struct_para_init(exmc_norsram_parameter_struct *exmc_norsram_init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == exmc_norsram_init_struct) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure control variables with default values */
        exmc_norsram_init_struct->norsram_region = EXMC_BANK0_NORSRAM_REGION0;
        exmc_norsram_init_struct->address_data_mux = ENABLE;
        exmc_norsram_init_struct->memory_type = EXMC_MEMORY_TYPE_SRAM;
        exmc_norsram_init_struct->databus_width = EXMC_NOR_DATABUS_WIDTH_8B;
        exmc_norsram_init_struct->burst_mode = DISABLE;
        exmc_norsram_init_struct->nwait_polarity = EXMC_NWAIT_POLARITY_LOW;
        exmc_norsram_init_struct->nwait_config = EXMC_NWAIT_CONFIG_BEFORE;
        exmc_norsram_init_struct->memory_write = ENABLE;
        exmc_norsram_init_struct->nwait_signal = ENABLE;
        exmc_norsram_init_struct->extended_mode = DISABLE;
        exmc_norsram_init_struct->asyn_wait = DISABLE;
        exmc_norsram_init_struct->cram_page_size = EXMC_CRAM_AUTO_SPLIT;
        exmc_norsram_init_struct->write_mode = EXMC_ASYN_WRITE;

        /* configure read/write timing */
        exmc_norsram_init_struct->read_write_timing = NULL;

        /* configure write timing when extended mode is used */
        exmc_norsram_init_struct->write_timing = NULL;
    }
}

/*!
    \brief      initialize EXMC NOR/SRAM region (API_ID(0x0003U))
    \param[in]  exmc_norsram_init_struct: configure the EXMC NOR/SRAM parameter
                  norsram_region: EXMC_BANK0_NORSRAM_REGIONx, x=0~3
                  write_mode: EXMC_ASYN_WRITE, EXMC_SYN_WRITE
                  extended_mode: ENABLE or DISABLE
                  asyn_wait: ENABLE or DISABLE
                  nwait_signal: ENABLE or DISABLE
                  memory_write: ENABLE or DISABLE
                  nwait_config: EXMC_NWAIT_CONFIG_BEFORE, EXMC_NWAIT_CONFIG_DURING
                  nwait_polarity: EXMC_NWAIT_POLARITY_LOW, EXMC_NWAIT_POLARITY_HIGH
                  burst_mode: ENABLE or DISABLE
                  databus_width: EXMC_NOR_DATABUS_WIDTH_8B, EXMC_NOR_DATABUS_WIDTH_16B, EXMC_NOR_DATABUS_WIDTH_32B
                  memory_type: EXMC_MEMORY_TYPE_SRAM, EXMC_MEMORY_TYPE_PSRAM, EXMC_MEMORY_TYPE_NOR
                  address_data_mux: ENABLE or DISABLE
                  cram_page_size: EXMC_CRAM_AUTO_SPLIT, EXMC_CRAM_PAGE_SIZE_128_BYTES, EXMC_CRAM_PAGE_SIZE_256_BYTES,
                    EXMC_CRAM_PAGE_SIZE_512_BYTES, EXMC_CRAM_PAGE_SIZE_1024_BYTES
                  read_write_timing: struct exmc_norsram_timing_parameter_struct set the time
                    asyn_access_mode: EXMC_ACCESS_MODE_A, EXMC_ACCESS_MODE_B, EXMC_ACCESS_MODE_C, EXMC_ACCESS_MODE_D
                    syn_data_latency: EXMC_DATALAT_x_CLK, x=2~17
                    syn_clk_division: EXMC_SYN_CLOCK_RATIO_x_CLK, x=2~16
                    bus_latency: 0x0U~0xFU
                    asyn_data_holdtime: 0~3 (0*CK_EXMC~3*CK_EXMC for read, 1*CK_EXMC~4*CK_EXMC for write)
                    asyn_data_setuptime: 1~255
                    asyn_address_holdtime: 1~15
                    asyn_address_setuptime: 0~15
                  write_timing: struct exmc_norsram_timing_parameter_struct set the time
                    asyn_access_mode: EXMC_ACCESS_MODE_A, EXMC_ACCESS_MODE_B, EXMC_ACCESS_MODE_C, EXMC_ACCESS_MODE_D
                    syn_data_latency: EXMC_DATALAT_x_CLK, x=2~17
                    syn_clk_division: EXMC_SYN_CLOCK_RATIO_x_CLK, x=2~16
                    bus_latency: 0~15
                    asyn_data_holdtime: 1~4 (1*CK_EXMC~4*CK_EXMC for write)
                    asyn_data_setuptime: 1~255
                    asyn_address_holdtime: 1~15
                    asyn_address_setuptime: 0~15
    \param[out] none
    \retval     none
*/
void exmc_norsram_init(exmc_norsram_parameter_struct *exmc_norsram_init_struct)
{
    uint32_t snctl = 0x00000000U, sntcfg = 0x00000000U, snwtcfg = 0x00000000U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if((NULL == exmc_norsram_init_struct) || (NULL == exmc_norsram_init_struct->write_timing) || (NULL == exmc_norsram_init_struct->read_write_timing)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get value of register EXMC_SNCTL */
        snctl = EXMC_SNCTL(exmc_norsram_init_struct->norsram_region);

        /* clear control bits */
        snctl &= (uint32_t)(~(EXMC_SNCTL_NREN | EXMC_SNCTL_NRTP | EXMC_SNCTL_NRW | EXMC_SNCTL_SBRSTEN |
                              EXMC_SNCTL_NRWTPOL | EXMC_SNCTL_NRWTCFG | EXMC_SNCTL_WEN |
                              EXMC_SNCTL_NRWTEN | EXMC_SNCTL_EXMODEN | EXMC_SNCTL_ASYNCWTEN | EXMC_SNCTL_SYNCWR |
                              EXMC_SNCTL_NRMUX | EXMC_SNCTL_BKREMAP | EXMC_SNCTL_CCK | EXMC_SNCTL_CPS));

        /* configure control bits */
        snctl |= (uint32_t)((exmc_norsram_init_struct->address_data_mux << SNCTL_NRMUX_OFFSET) |
                            exmc_norsram_init_struct->memory_type |
                            exmc_norsram_init_struct->databus_width |
                            (exmc_norsram_init_struct->burst_mode << SNCTL_SBRSTEN_OFFSET) |
                            exmc_norsram_init_struct->nwait_polarity |
                            exmc_norsram_init_struct->nwait_config |
                            (exmc_norsram_init_struct->memory_write << SNCTL_WREN_OFFSET) |
                            (exmc_norsram_init_struct->nwait_signal << SNCTL_NRWTEN_OFFSET) |
                            (exmc_norsram_init_struct->extended_mode << SNCTL_EXMODEN_OFFSET) |
                            (exmc_norsram_init_struct->asyn_wait << SNCTL_ASYNCWAITEN_OFFSET) |
                            exmc_norsram_init_struct->write_mode |
                            exmc_norsram_init_struct->cram_page_size);

        /* nor flash access enable */
        if(EXMC_MEMORY_TYPE_NOR == exmc_norsram_init_struct->memory_type) {
            snctl |= (uint32_t)EXMC_SNCTL_NREN;
        }

        /* configure timing */
        sntcfg = (uint32_t)(exmc_norsram_init_struct->read_write_timing->asyn_address_setuptime |
                            (exmc_norsram_init_struct->read_write_timing->asyn_address_holdtime << SNTCFG_AHLD_OFFSET) |
                            (exmc_norsram_init_struct->read_write_timing->asyn_data_setuptime << SNTCFG_DSET_OFFSET) |
                            (exmc_norsram_init_struct->read_write_timing->bus_latency << SNTCFG_BUSLAT_OFFSET) |
                            exmc_norsram_init_struct->read_write_timing->syn_clk_division |
                            exmc_norsram_init_struct->read_write_timing->syn_data_latency |
                            exmc_norsram_init_struct->read_write_timing->asyn_access_mode |
                            (exmc_norsram_init_struct->read_write_timing->asyn_data_holdtime << SNTCFG_DHLD_OFFSET));

        if(ENABLE == exmc_norsram_init_struct->extended_mode) {
            /* for extended mode, configure write timing */
            snwtcfg = (uint32_t)(exmc_norsram_init_struct->write_timing->asyn_address_setuptime |
                                 (exmc_norsram_init_struct->write_timing->asyn_address_holdtime << SNTCFG_AHLD_OFFSET) |
                                 (exmc_norsram_init_struct->write_timing->asyn_data_setuptime << SNTCFG_DSET_OFFSET) |
                                 (exmc_norsram_init_struct->write_timing->bus_latency << SNTCFG_BUSLAT_OFFSET) |
                                 exmc_norsram_init_struct->write_timing->asyn_access_mode |
                                 ((exmc_norsram_init_struct->read_write_timing->asyn_data_holdtime - 1U) << SNTCFG_DHLD_OFFSET));
        } else {
            snwtcfg = BANK0_SNWTCFG_RESET;
        }

        /* configure the registers */
        EXMC_SNCTL(exmc_norsram_init_struct->norsram_region) = snctl;
        EXMC_SNTCFG(exmc_norsram_init_struct->norsram_region) = sntcfg;
        EXMC_SNWTCFG(exmc_norsram_init_struct->norsram_region) = snwtcfg;
    }
}

/*!
    \brief      enable EXMC NOR/PSRAM bank region (API_ID(0x0004U))
    \param[in]  exmc_norsram_region: specify the region of NOR/PSRAM bank
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK0_NORSRAM_REGIONx(x=0..3): EXMC BANK0 REGIONx
    \param[out] none
    \retval     none
*/
void exmc_norsram_enable(uint32_t exmc_norsram_region)
{
    EXMC_SNCTL(exmc_norsram_region) |= (uint32_t)EXMC_SNCTL_NRBKEN;
}

/*!
    \brief      disable EXMC NOR/PSRAM bank region (API_ID(0x0005U))
    \param[in]  exmc_norsram_region: specify the region of NOR/PSRAM Bank
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK0_NORSRAM_REGIONx(x=0..3): EXMC BANK0 REGIONx
    \param[out] none
    \retval     none
*/
void exmc_norsram_disable(uint32_t exmc_norsram_region)
{
    EXMC_SNCTL(exmc_norsram_region) &= ~(uint32_t)EXMC_SNCTL_NRBKEN;
}

/*!
    \brief      deinitialize EXMC NAND bank (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void exmc_nand_deinit(void)
{
    /* deinitialize EXMC_BANK2_NAND */
    EXMC_NCTL = BANK2_NCTL_RESET;
    EXMC_NINTEN = BANK2_NINTEN_RESET;
    EXMC_NCTCFG = BANK2_NCTCFG_RESET;
    EXMC_NATCFG = BANK2_NATCFG_RESET;
}

/*!
    \brief      initialize exmc_nand_parameter_struct with the default values (API_ID(0x0007U))
    \param[in]  none
    \param[out] the initialized struct exmc_nand_parameter_struct pointer
    \retval     none
*/
void exmc_nand_struct_para_init(exmc_nand_parameter_struct *exmc_nand_init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == exmc_nand_init_struct) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the structure with default values */
        exmc_nand_init_struct->wait_feature = DISABLE;
        exmc_nand_init_struct->databus_width = EXMC_NAND_DATABUS_WIDTH_8B;
        exmc_nand_init_struct->ecc_logic = DISABLE;
        exmc_nand_init_struct->ecc_size = EXMC_ECC_SIZE_256BYTES;
        exmc_nand_init_struct->ctr_latency = 0x00U;
        exmc_nand_init_struct->atr_latency = 0x00U;
        exmc_nand_init_struct->common_space_timing = NULL;
        exmc_nand_init_struct->attribute_space_timing = NULL;
    }
}

/*!
    \brief      initialize EXMC NAND bank (API_ID(0x0008U))
    \param[in]  exmc_nand_init_struct: configure the EXMC NAND parameter
                  ecc_size: EXMC_ECC_SIZE_xBYTES,x=256,512,1024,2048,4096
                  atr_latency: EXMC_ALE_RE_DELAY_x_CK_EXMC,x=1~16
                  ctr_latency: EXMC_CLE_RE_DELAY_x_CK_EXMC,x=1~16
                  ecc_logic: ENABLE or DISABLE
                  databus_width: EXMC_NAND_DATABUS_WIDTH_8B,EXMC_NAND_DATABUS_WIDTH_16B
                  wait_feature: ENABLE or DISABLE
                  nand_nwait_gpio:EXMC_NWAIT_GPIO_PD6_PC6 or EXMC_NWAIT_GPIO_PA1
                  common_space_timing: struct exmc_nand_timing_parameter_struct set the time
                    databus_hiztime: 1~255
                    holdtime: 1~254
                    waittime: 2~255
                    setuptime: 1~255
                  attribute_space_timing: struct exmc_nand_timing_parameter_struct set the time
                    databus_hiztime: 0~254
                    holdtime: 1~254
                    waittime: 2~255
                    setuptime: 1~255
    \param[out] none
    \retval     none
*/
void exmc_nand_init(exmc_nand_parameter_struct *exmc_nand_init_struct)
{
    uint32_t nctl = 0x00000000U, nctcfg = 0x00000000U, natcfg = 0x00000000U;

